STMicroelectronics/stm32-external-loader/STM32F7x_boards/N25Q128A_STM32F7508-DISCO/Sources/Library/stm32f7xx_quadspi.c
/**
  ******************************************************************************
  * @file    stm32f7xx_quadspi.c
  * @author  MCD Application Team
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the Serial peripheral interface (QUADSPI):
  *           + Initialization and Configuration
  *           + Indirect Data Read/Write functions
  *           + Memory Mapped Mode Data Read functions  
  *           + Automatic Polling functions
  *           + DMA transfers management
  *           + Interrupts and flags management 
  *
  *  @verbatim
  *
 ===============================================================================
                       ##### How to use this driver #####
 ===============================================================================
    [..]
        (#) Enable peripheral clock using   RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_QSPI,ENABLE);
            function.

        (#) Enable CLK, BK1_IO0, BK1_IO1, BK1_IO2, BK1_IO3, BK1_NCS, BK2_IO0, 
            BK2_IO1, BK2_IO2, BK2_IO3 and BK2_NCS GPIO clocks using 
            RCC_AHB1PeriphClockCmd() function. 
  
        (#) Peripherals alternate function: 
           (++) Connect the pin to the desired peripherals' Alternate 
                 Function (AF) using GPIO_PinAFConfig() function.
           (++) Configure the desired pin in alternate function by:
                 GPIO_InitStruct->GPIO_Mode = GPIO_Mode_AF.
           (++) Select the type, pull-up/pull-down and output speed via 
                 GPIO_PuPd, GPIO_OType and GPIO_Speed members.
           (++) Call GPIO_Init() function.
  
        (#) Program the Flash Size, CS High Time, Sample Shift, Prescaler, Clock Mode 
            values using the QUADSPI_Init() function.
            
        (#) Enable QUADSPI using  QUADSPI_Cmd() function.
        
        (#) Set QUADSPI Data Length using QUADSPI_SetDataLength() function.
  
        (#) Configure the FIFO threshold using QUADSPI_SetFIFOThreshold() to select 
            at which threshold the FTF event is generated.

        (#) Enable the NVIC and the corresponding interrupt using the function 
            QUADSPI_ITConfig() if you need to use interrupt mode. 
  
        (#) When using the DMA mode 
           (++) Configure the DMA using DMA_Init() function.
           (++) Active the needed channel Request using SPI_I2S_DMACmd() function.
   
        (#) Enable the SPI using the QUADSPI_DMACmd() function.
   
        (#) Enable the DMA using the DMA_Cmd() function when using DMA mode.  
  
    @endverbatim 
   *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_quadspi.h"

/** @addtogroup STM32F7xx_StdPeriph_Driver
  * @{
  */

/** @defgroup QUADSPI
  * @brief QUADSPI driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define QUADSPI_CR_CLEAR_MASK                           0x00FFFFCF
#define QUADSPI_DCR_CLEAR_MASK                          0xFFE0F7FE
#define QUADSPI_CCR_CLEAR_MASK                          0x90800000
#define QUADSPI_PIR_CLEAR_MASK                          0xFFFF0000
#define QUADSPI_LPTR_CLEAR_MASK                         0xFFFF0000
#define QUADSPI_CCR_CLEAR_INSTRUCTION_MASK              0xFFFFFF00
#define QUADSPI_CCR_CLEAR_DCY_MASK                      0xFFC3FFFF
#define QUADSPI_CR_CLEAR_FIFOTHRESHOLD_MASK             0xFFFFF0FF
#define QUADSPI_CR_INTERRUPT_MASK                       0x001F0000
#define QUADSPI_SR_INTERRUPT_MASK                       0x0000001F

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/


/* Initialization and Configuration functions *********************************/

/** @defgroup <PPP>_Private_Functions 
  * @{
  */

/** @defgroup <PPP>_Group1 Function Group1 Name
 *  @brief   Function group1 name description (copied from the header file) 
 *
@verbatim  
 ===============================================================================
     ##### < Function group1 name (copied from the header file)
 Note: do not use "Peripheral" or "PPP" word in the function group name >  #####
 ===============================================================================

       [..] < OPTIONAL:
              Add here the most important information to know about the IP features
              covered by this group of function.
        
              For system IPs, this section contains how to use this group API.
            >

@endverbatim
  * @{
  */   

/**
  * @brief  Deinitializes the QUADSPI peripheral registers to their default
  *         reset values.
  * @param  None
  * @retval None
  */
void QUADSPI_DeInit(void)
{
    /* Enable QUADSPI reset state */
    RCC_AHB3PeriphResetCmd(RCC_AHB3Periph_QSPI, ENABLE);
    /* Release QUADSPI from reset state */
    RCC_AHB3PeriphResetCmd(RCC_AHB3Periph_QSPI, DISABLE);
}

/**
  * @brief  Fills each QUADSPI_InitStruct member with its default value.
  * @param  QUADSPI_InitStruct: pointer to a QUADSPI_InitTypeDef structure which will be initialized.
  * @retval None
  */
void QUADSPI_StructInit(QUADSPI_InitTypeDef* QUADSPI_InitStruct)
{
/*--------- Reset QUADSPI init structure parameters default values ------------*/
  /* Initialize the QUADSPI_SShift member */
  QUADSPI_InitStruct->QUADSPI_SShift = QUADSPI_SShift_NoShift ;
  /* Initialize the QUADSPI_Prescaler member */  
  QUADSPI_InitStruct->QUADSPI_Prescaler = 0 ;
  /* Initialize the QUADSPI_CKMode member */
  QUADSPI_InitStruct->QUADSPI_CKMode = QUADSPI_CKMode_Mode0 ;
  /* Initialize the QUADSPI_CSHTime member */
  QUADSPI_InitStruct->QUADSPI_CSHTime = QUADSPI_CSHTime_1Cycle ;
  /* Initialize the QUADSPI_FSize member */
  QUADSPI_InitStruct->QUADSPI_FSize = 0 ;
  /* Initialize the QUADSPI_FSelect member */
  QUADSPI_InitStruct->QUADSPI_FSelect = QUADSPI_FSelect_1 ;
  /* Initialize the QUADSPI_DFlash member */
  QUADSPI_InitStruct->QUADSPI_DFlash = QUADSPI_DFlash_Disable ;
}

/**
  * @brief  Fills each QUADSPI_ComConfig_InitStruct member with its default value.
  * @param  QUADSPI_ComConfig_InitStruct: pointer to a QUADSPI_ComConfig_InitTypeDef structure which will be initialized.
  * @retval None
  */
void QUADSPI_ComConfig_StructInit(QUADSPI_ComConfig_InitTypeDef* QUADSPI_ComConfig_InitStruct)
{
/*--------- Reset QUADSPI ComConfig init structure parameters default values ------------*/
    
/* Set QUADSPI Communication configuration structure parameters default values */
  /* Initialize the QUADSPI_ComConfig_DDRMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DDRMode = QUADSPI_ComConfig_DDRMode_Disable ;
  /* Initialize the QUADSPI_ComConfig_DHHC member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DHHC = QUADSPI_ComConfig_DHHC_Disable ;
  /* Initialize the QUADSPI_ComConfig_SIOOMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_SIOOMode = QUADSPI_ComConfig_SIOOMode_Disable ;
  /* Initialize the QUADSPI_ComConfig_FMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_FMode = QUADSPI_ComConfig_FMode_Indirect_Write ;
  /* Initialize the QUADSPI_ComConfig_DMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DMode = QUADSPI_ComConfig_DMode_NoData ;
  /* Initialize the QUADSPI_ComConfig_DummyCycles member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DummyCycles = 0 ;
  /* Initialize the QUADSPI_ComConfig_ABSize member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABSize = QUADSPI_ComConfig_ABSize_8bit ;
  /* Initialize the QUADSPI_ComConfig_ABMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABMode = QUADSPI_ComConfig_ABMode_NoAlternateByte ;
  /* Initialize the QUADSPI_ComConfig_ADSize member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADSize = QUADSPI_ComConfig_ADSize_8bit ;
  /* Initialize the QUADSPI_ComConfig_ADMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADMode = QUADSPI_ComConfig_ADMode_NoAddress ;
  /* Initialize the QUADSPI_ComConfig_IMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_IMode = QUADSPI_ComConfig_IMode_NoInstruction ;
  /* Initialize the QUADSPI_ComConfig_Ins member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_Ins = 0 ;
}

/**
  * @brief  Initializes the QUADSPI peripheral according to the specified 
  *         parameters in the QUADSPI_InitStruct.
  * @param  QUADSPI_InitStruct: pointer to a QUADSPI_InitTypeDef structure that
  *         contains the configuration information for the specified QUADSPI peripheral.
  * @retval None
  */
void QUADSPI_Init(QUADSPI_InitTypeDef* QUADSPI_InitStruct)
{
  uint32_t tmpreg = 0;
  
  /* Check the QUADSPI parameters */
  assert_param(IS_QUADSPI_SSHIFT(QUADSPI_InitStruct->QUADSPI_SShift));
  assert_param(IS_QUADSPI_PRESCALER(QUADSPI_InitStruct->QUADSPI_Prescaler));
  assert_param(IS_QUADSPI_CKMODE(QUADSPI_InitStruct->QUADSPI_CKMode));
  assert_param(IS_QUADSPI_CSHTIME(QUADSPI_InitStruct->QUADSPI_CSHTime));
  assert_param(IS_QUADSPI_FSIZE(QUADSPI_InitStruct->QUADSPI_FSize));
	assert_param(IS_QUADSPI_FSEL(QUADSPI_InitStruct->QUADSPI_FSelect));
	assert_param(IS_QUADSPI_DFM(QUADSPI_InitStruct->QUADSPI_DFlash));
  
  /*------------------------ QUADSPI CR Configuration ------------------------*/
  /* Get the QUADSPI CR1 value */
  tmpreg = QUADSPI->CR;
  /* Clear PRESCALER and SSHIFT bits */
  tmpreg &= QUADSPI_CR_CLEAR_MASK;
  /* Configure QUADSPI: Prescaler and Sample Shift */
  tmpreg |= (uint32_t)(((QUADSPI_InitStruct->QUADSPI_Prescaler)<<24)
                        |(QUADSPI_InitStruct->QUADSPI_SShift)
	                      |(QUADSPI_InitStruct->QUADSPI_FSelect)
	                      |(QUADSPI_InitStruct->QUADSPI_DFlash));  
  /* Write to QUADSPI CR */
  QUADSPI->CR = tmpreg;
  
  /*------------------------ QUADSPI DCR Configuration ------------------------*/
  /* Get the QUADSPI DCR value */
  tmpreg = QUADSPI->DCR;
  /* Clear FSIZE, CSHT and CKMODE bits */
  tmpreg &= QUADSPI_DCR_CLEAR_MASK;
  /* Configure QUADSPI: Flash Size, Chip Select High Time and Clock Mode */
  tmpreg |= (uint32_t)(((QUADSPI_InitStruct->QUADSPI_FSize)<<16)
                        |(QUADSPI_InitStruct->QUADSPI_CSHTime)
                        |(QUADSPI_InitStruct->QUADSPI_CKMode));  
  /* Write to QUADSPI DCR */
  QUADSPI->DCR = tmpreg;  
}

/**
  * @brief  Initializes the QUADSPI CCR according to the specified 
  *         parameters in the QUADSPI_ComConfig_InitStruct.
  * @param  QUADSPI_ComConfig_InitStruct: pointer to a QUADSPI_ComConfig_InitTypeDef structure that
  *         contains the communiction configuration informations about QUADSPI peripheral.
  * @retval None
  */
void QUADSPI_ComConfig_Init(QUADSPI_ComConfig_InitTypeDef* QUADSPI_ComConfig_InitStruct)
{
  uint32_t tmpreg = 0;

