STMicroelectronics/stm32-external-loader/STM32F7x_boards/N25Q128A_STM32F7508-DISCO/Sources/Library/stm32f7xx_quadspi.c
  /* Check the QUADSPI Communication Control parameters */
  assert_param(IS_QUADSPI_FMODE       (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_FMode));
  assert_param(IS_QUADSPI_SIOOMODE    (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_SIOOMode));
  assert_param(IS_QUADSPI_DMODE       (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DMode));
  assert_param(IS_QUADSPI_DCY         (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DummyCycles));
  assert_param(IS_QUADSPI_ABSIZE      (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABSize));
  assert_param(IS_QUADSPI_ABMODE      (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABMode));
  assert_param(IS_QUADSPI_ADSIZE      (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADSize));
  assert_param(IS_QUADSPI_ADMODE      (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADMode));
  assert_param(IS_QUADSPI_IMODE       (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_IMode));
  assert_param(IS_QUADSPI_INSTRUCTION (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_Ins));
	assert_param(IS_QUADSPI_DDRMODE     (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DDRMode));
	assert_param(IS_QUADSPI_DHHC        (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DHHC));
  
  /*------------------------ QUADSPI CCR Configuration ------------------------*/
  /* Get the QUADSPI CCR value */
  tmpreg = QUADSPI->CCR;
  /* Clear FMODE Mode bits */
  tmpreg &= QUADSPI_CCR_CLEAR_MASK;
  /* Configure QUADSPI: CCR Configuration */
  tmpreg |=  (uint32_t)( (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_FMode)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DDRMode)
											 | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DHHC)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_SIOOMode)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DMode)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABSize)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABMode)                                                                       
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADSize)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADMode)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_IMode)
                       | (QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_Ins)
                       |((QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DummyCycles)<<18));    
  /* Write to QUADSPI DCR */
  QUADSPI->CCR = tmpreg;      
}

/**
  * @brief  Enables or disables QUADSPI peripheral.
  * @param  NewState: new state of the QUADSPI peripheral. 
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void QUADSPI_Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable QUADSPI peripheral */
    QUADSPI->CR |= QUADSPI_CR_EN;
  }
  else
  {
    /* Disable QUADSPI peripheral */
    QUADSPI->CR &= ~ QUADSPI_CR_EN;
  }
}

/**
  * @brief  Configure the QUADSPI Automatic Polling Mode.
  * @param  QUADSPI_Match: Value to be compared with the masked status register to get a match. 
  *          This parameter can be any value between 0x00000000 and 0xFFFFFFFF.
  * @param  QUADSPI_Mask: Mask to be applied to the status bytes received in polling mode.. 
  *          This parameter can be any value between 0x00000000 and 0xFFFFFFFF.
  * @param  QUADSPI_Match_Mode: indicates which method should be used for determining a “match” during
  *         automatic polling mode. 
  *          This parameter can be any value of :
  *            @arg QUADSPI_PMM_AND: AND match mode- SMF is set if all the unmasked bits received from the flash match
  *                 the corresponding bits in the match register
  *            @arg QUADSPI_PMM_OR: OR match mode- SMF is set if any one of the unmasked bits received from the flash
                    matches its corresponding bit in the match register.
  * @note   This function is used only in Automatic Polling Mode
  * @retval None
  */
void QUADSPI_AutoPollingMode_Config(uint32_t QUADSPI_Match, uint32_t QUADSPI_Mask , uint32_t QUADSPI_Match_Mode)
{
  /* Check the parameters */
  assert_param(IS_QUADSPI_PMM(QUADSPI_Match_Mode));

  if (!(QUADSPI->SR & QUADSPI_SR_BUSY))
  /* Device is not Busy */
  {
    /* Set the Match Register */
    QUADSPI->PSMAR = QUADSPI_Match ;

    /* Set the Mask Register */
    QUADSPI->PSMKR = QUADSPI_Mask ;
    
    /* Set the Polling Match Mode */
    if(QUADSPI_Match_Mode)
    /* OR Match Mode */
    {
      /* Set the PMM bit */
      QUADSPI->CR |= QUADSPI_CR_PMM;
    }
    else
    /* AND Match Mode */
    {
      /* Reset the PMM bit */
      QUADSPI->CR &= ~ QUADSPI_CR_PMM;
    }
  }
}

/**
  * @brief  Sets the number of CLK cycle between two read during automatic polling phases.
  * @param  QUADSPI_Interval: The number of CLK cycle between two read during automatic polling phases. 
  *          This parameter can be any value of between 0x0000 and 0xFFFF
  * @note   This function is used only in Automatic Polling Mode  
  * @retval None
  */
void QUADSPI_AutoPollingMode_SetInterval(uint32_t QUADSPI_Interval)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_QUADSPI_PIR(QUADSPI_Interval));

  if (!(QUADSPI->SR & QUADSPI_SR_BUSY))
  /* Device is not Busy */
  {
    /* Read the PIR Register */
    tmpreg = QUADSPI->PIR ;
    /* Clear Polling interval Bits */
    tmpreg &= QUADSPI_PIR_CLEAR_MASK ;
    /* Set the QUADSPI Polling Interval Bits */
    tmpreg |= QUADSPI_Interval;
    /* Write the PIR Register */
    QUADSPI->PIR = tmpreg;
  }
}

/**
  * @brief  Sets the value of the Timeout in Memory Mapped mode
  * @param  QUADSPI_Timeout: This field indicates how many CLK cycles QuadSPI waits after the 
  *         FIFO becomes full until it raises nCS, putting the flash memory 
  *         in a lowerconsumption state. 
  *         This parameter can be any value of between 0x0000 and 0xFFFF
  * @note   This function is used only in Memory Mapped Mode  
  * @retval None
  */
void QUADSPI_MemoryMappedMode_SetTimeout(uint32_t QUADSPI_Timeout)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_QUADSPI_TIMEOUT(QUADSPI_Timeout));

