STMicroelectronics/stm32-external-loader/STM32F7x_boards/N25Q128A_STM32F7508-DISCO/Sources/Library/stm32f7xx_quadspi.c
  quadspibase = (uint32_t)QUADSPI; 
  quadspibase += 0x20;
  
  return *(__IO uint8_t *) quadspibase;
}

/**
  * @brief  Returns the most recent received 16bit data by the QUADSPI peripheral. 
  * @retval The value of the received data.
  */
uint16_t QUADSPI_ReceiveData16(void)
{
  uint32_t quadspibase = 0;
  
  quadspibase = (uint32_t)QUADSPI; 
  quadspibase += 0x20;
  
  return *(__IO uint16_t *) quadspibase;
}

/**
  * @brief  Returns the most recent received 32bit data by the QUADSPI peripheral. 
  * @retval The value of the received data.
  */
uint32_t QUADSPI_ReceiveData32(void)
{
  return QUADSPI->DR;
}

/* DMA transfers management functions *****************************************/

/**
  * @brief  Enables or disables DMA for Indirect Mode.
  * @param  NewState: new state of the Timeout Counter. 
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void QUADSPI_DMACmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable DMA */
    QUADSPI->CR |= QUADSPI_CR_DMAEN;
  }
  else
  {
    /* Disable DMA */
    QUADSPI->CR &= ~ QUADSPI_CR_DMAEN;
  }
}

/* Interrupts and flags management functions **********************************/

/**
  * @brief  Enables or disables the specified QUADSPI interrupts.
  * @param  QUADSPI_IT: specifies the QUADSPI interrupt source to be enabled or disabled. 
  *          This parameter can be one of the following values:
  *            @arg QUADSPI_IT_TO: Timeout interrupt
  *            @arg QUADSPI_IT_SM: Status Match interrupt
  *            @arg QUADSPI_IT_FT: FIFO Threshold
  *            @arg QUADSPI_IT_TC: Transfer Complete
  *            @arg QUADSPI_IT_TE: Transfer Error      
  * @param  NewState: new state of the specified QUADSPI interrupt.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void QUADSPI_ITConfig(uint32_t QUADSPI_IT, FunctionalState NewState)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_QUADSPI_CONFIG_IT(QUADSPI_IT));

  /* Read the CR Register */
  tmpreg = QUADSPI->CR ;
  
  if (NewState != DISABLE)
  {
    /* Enable the selected QUADSPI interrupt */
    tmpreg |= QUADSPI_IT;
  }
  else
  {
    /* Disable the selected QUADSPI interrupt */
    tmpreg &= ~QUADSPI_IT;
  }
  /* Write the CR Register */
  QUADSPI->CR = tmpreg ;  
}

/**
  * @brief  Returns the current QUADSPI FIFO filled level.
  * @retval Number of valid bytes which are being held in the FIFO.
  *         0x00 : FIFO is empty
  *         0x1F : FIFO is full    
  */
uint32_t QUADSPI_GetFIFOLevel(void)
{
  /* Get the QUADSPI FIFO level bits */
  return ((QUADSPI->SR & QUADSPI_SR_FLEVEL)>> 8);
}

/**
  * @brief  Returns the QUADSPI functional mode.  
  * @param  None 
  * @retval QUADSPI Functional Mode .The returned value can be one of the following:
  *              - 0x00000000: QUADSPI_FMode_Indirect_Write
  *              - 0x04000000: QUADSPI_FMode_Indirect_Read
  *              - 0x08000000: QUADSPI_FMode_AutoPolling
  *              - 0x0C000000: QUADSPI_FMode_MemoryMapped
  */
uint32_t QUADSPI_GetFMode(void)
{
  /* Return the QUADSPI_FMode */
  return  (QUADSPI->CCR & QUADSPI_CCR_FMODE);
}

/**
  * @brief  Checks whether the specified QUADSPI flag is set or not.  
  * @param  QUADSPI_FLAG: specifies the QUADSPI flag to check. 
  *          This parameter can be one of the following values:
  *            @arg QUADSPI_FLAG_TO: Timeout interrupt flag
  *            @arg QUADSPI_FLAG_SM: Status Match interrupt flag
  *            @arg QUADSPI_FLAG_FT: FIFO Threshold flag
  *            @arg QUADSPI_FLAG_TC: Transfer Complete flag
  *            @arg QUADSPI_FLAG_TE: Transfer Error flag
  *            @arg QUADSPI_FLAG_BUSY: Busy flag      
  * @retval The new state of QUADSPI_FLAG (SET or RESET).
  */
FlagStatus QUADSPI_GetFlagStatus(uint32_t QUADSPI_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_QUADSPI_GET_FLAG(QUADSPI_FLAG));

  /* Check the status of the specified QUADSPI flag */
  if (QUADSPI->SR & QUADSPI_FLAG)
  {
    /* QUADSPI_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* QUADSPI_FLAG is reset */
    bitstatus = RESET;
  }
  /* Return the QUADSPI_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the QUADSPI flag.
  * @param  QUADSPI_FLAG: specifies the QUADSPI flag to clear. 
  *          This parameter can be one of the following values:
  *            @arg QUADSPI_FCLEAR_TO: Timeout interrupt flag
  *            @arg QUADSPI_FCLEAR_SM: Status Match interrupt flag
  *            @arg QUADSPI_FCLEAR_TC: Transfer Complete flag
  *            @arg QUADSPI_FCLEAR_TE: Transfer Error flag
  * @retval None
  */
void QUADSPI_ClearFlag(uint32_t QUADSPI_FLAG)
{
  /* Check the parameters */
  assert_param(IS_QUADSPI_CLEAR_FLAG(QUADSPI_FLAG));

  /* Clear the selected QUADSPI flags */
  QUADSPI->FCR = QUADSPI_FLAG;
}

/**
  * @brief  Checks whether the specified QUADSPI interrupt has occurred or not.
  * @param  QUADSPI_IT: specifies the QUADSPI interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg QUADSPI_IT_TO: Timeout interrupt 
  *            @arg QUADSPI_IT_SM: Status Match interrupt
  *            @arg QUADSPI_IT_FT: FIFO Threshold
  *            @arg QUADSPI_IT_TC: Transfer Complete
  *            @arg QUADSPI_IT_TE: Transfer Error    
  * @retval The new state of QUADSPI_IT (SET or RESET).
  */
ITStatus QUADSPI_GetITStatus(uint32_t QUADSPI_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpcreg = 0,tmpsreg = 0; 

  /* Check the parameters */
  assert_param(IS_QUADSPI_GET_IT(QUADSPI_IT));

  /* Read the QUADSPI CR */
  tmpcreg = QUADSPI->CR ;
  
  tmpcreg &= QUADSPI_CR_INTERRUPT_MASK ;
  
  /* Shift the Masked Control Register to be aligned with Masked Status Register */
  tmpcreg = (tmpcreg >> 16);
  
  /* Read the QUADSPI SR */
  tmpsreg = QUADSPI->SR ;
  
  tmpsreg &= QUADSPI_SR_INTERRUPT_MASK;

  /* Check the status of the specified QUADSPI interrupt */
  if (tmpcreg & tmpsreg)
  {
    /* QUADSPI_IT is set */
    bitstatus = SET;
  }
  else
  {
    /* QUADSPI_IT is reset */
    bitstatus = RESET;
  }
  /* Return the QUADSPI_IT status */
  return bitstatus;
}

/**
  * @brief  Clears the QUADSPI's interrupt pending bits.
  * @param  QUADSPI_IT: specifies the QUADSPI pending bit to clear. 
  *          This parameter can be one of the following values:
  *            @arg QUADSPI_IT_TO: Timeout interrupt 
  *            @arg QUADSPI_IT_SM: Status Match interrupt
  *            @arg QUADSPI_IT_TC: Transfer Complete
  *            @arg QUADSPI_IT_TE: Transfer Error 
  * @retval None
  */
void QUADSPI_ClearITPendingBit(uint32_t QUADSPI_IT)
{
  uint32_t itmask = 0;
  /* Check the parameters */
  assert_param(IS_QUADSPI_GET_IT(QUADSPI_IT)); 
  
  itmask = QUADSPI_IT >> 0x10;
  QUADSPI->FCR = (uint32_t)itmask;
}

/**
  * @brief  Enables or disables QUADSPI Dual Flash Mode.
  * @param  NewState: new state of the QUADSPI Dual Flash Mode. 
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void QUADSPI_DualFlashMode_Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable QUADSPI Dual Flash Mode */
    QUADSPI->CR |= QUADSPI_CR_DFM;
  }
  else
  {
    /* Disable QUADSPI Dual Flash Mode */
    QUADSPI->CR &= ~ QUADSPI_CR_DFM;
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
